In [53]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [54]:
df=pd.read_excel('data.xlsx') #load excel file

In [55]:
df

,Pid,Product Name,Origin,Cost,Brand,Unnamed col,Model,Entry-date,Amazon,Flipkart
0,P1,laptop,china,289000,Lenovo,1,L1-1997,01-Jan-2025,0,1
1,P2,mobile,US,100$,Oppo F11,1,M1-2015,03-Dec-2025,0,1
2,P3,tablet,china,89000,SAMsung,1,"t12,2000",-2017,1,0
3,P4,laptop,India,NaN,APPLE,1,L1-2017,-2018,1,1
4,P5,head phone,US,10$,BOAt,1,H3:2022,-2025,0,1
5,P6,laptop,India,2750000,LENvo,1,L3:2015,0.000148,1,0
6,P2,mobile,US,100$,Oppo F11,1,M1:2015,03-Dec-2025,0,1
7,P7,NaN,china,3000,Vivo,1,t12:2000,-2025,0,1

CHECK DUPLICATES

In [56]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [57]:
df = df.drop_duplicates()

CHECK MISSING VALUES

In [58]:
df.isnull().sum()

Pid             0
Product Name    1
Origin          0
Cost            1
Brand           0
Unnamed col     0
Model           0
Entry-date      0
Amazon          0
Flipkart        0
dtype: int64

REMOVE UNWANTED COLUMNS

In [59]:
df.drop(columns=['Unnamed col'], inplace=True)

RENAME COLUMNS

In [60]:
df.rename(columns={
    'Pid': 'Product_ID',
    'Product Name': 'Product',
    'Entry-date': 'Entry_Date'
}, inplace=True)

MAINTAIN PRICE IN RUPEES ONLY 
REMOVE $ AND CONVERT TO NUMRIC

In [61]:
df['Cost'] = df['Cost'].astype(str).str.replace('$','')
df['Cost'] = pd.to_numeric(df['Cost'], errors='coerce')

Split Model column using separators

Model examples:

L1-1997

H3:2022

In [62]:
df[['Model_Code', 'Model_Year']] = df['Model'].str.split('[-:]', expand=True)

Extract month from Entry_Date into new column

In [63]:
df['Entry_Date'] = pd.to_datetime(df['Entry_Date'], errors='coerce')

df['Month'] = df['Entry_Date'].dt.month_name()

Create new DataFrame with

Product, Cost, Amazon, Flipkart (3 columns)
(using melt)

In [64]:
new_df = df.melt(
    id_vars=['Product', 'Cost'],
    value_vars=['Amazon', 'Flipkart'],
    var_name='Platform',
    value_name='Available'
)

Keep only available products

In [65]:
new_df = new_df[new_df['Available'] == 1]

FINAL OUTPUT CHECK

In [68]:
df

,Product_ID,Product,Origin,Cost,Brand,Model,Entry_Date,Amazon,Flipkart,Model_Code,Model_Year,Month
0,P1,laptop,china,289000.0,Lenovo,L1-1997,2025-01-01,0,1,L1,1997,January
1,P2,mobile,US,100.0,Oppo F11,M1-2015,2025-12-03,0,1,M1,2015,December
2,P3,tablet,china,89000.0,SAMsung,"t12,2000",NaT,1,0,"t12,2000",None,NaN
3,P4,laptop,India,NaN,APPLE,L1-2017,NaT,1,1,L1,2017,NaN
4,P5,head phone,US,10.0,BOAt,H3:2022,NaT,0,1,H3,2022,NaN
5,P6,laptop,India,2750000.0,LENvo,L3:2015,NaT,1,0,L3,2015,NaN
6,P2,mobile,US,100.0,Oppo F11,M1:2015,2025-12-03,0,1,M1,2015,December
7,P7,NaN,china,3000.0,Vivo,t12:2000,NaT,0,1,t12,2000,NaN

In [69]:
new_df

       Product       Cost  Platform  Available
2       tablet    89000.0    Amazon          1
3       laptop        NaN    Amazon          1
5       laptop  2750000.0    Amazon          1
8       laptop   289000.0  Flipkart          1
9       mobile      100.0  Flipkart          1
11      laptop        NaN  Flipkart          1
12  head phone       10.0  Flipkart          1
14      mobile      100.0  Flipkart          1
15         NaN     3000.0  Flipkart          1